Диплом/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ПериодС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_По</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Диплом/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

Диплом/src/Catalogs/ДоговорыКонтрагентов/Forms/ФормаЭлемента/Module.bsl
//++i.skachkova 30.04.2024 
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Элементы.Найти("АбонентскаяПлата") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("АбонентскаяПлата", Тип("ПолеФормы"));		
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Абонентская плата";
	КонецЕсли;
		
	Если Элементы.Найти("СтоимостьЧасаРаботы") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));		
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Стоимость часа работы";
	КонецЕсли;
	
	ГруппаПериод = Элементы.Добавить("ГруппаПериод", Тип("ГруппаФормы"),ЭтотОбъект);
	ГруппаПериод.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериод.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	ГруппаПериод.ОтображатьЗаголовок = Ложь;
	ГруппаПериод.Отображение = ОтображениеОбычнойГруппы.Нет;

		
	Если Элементы.Найти("ПериодС") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("ПериодС", Тип("ПолеФормы"), ГруппаПериод);		
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ПериодС";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "Период с";
	КонецЕсли;
		
	Если Элементы.Найти("По") = Неопределено Тогда
		НовыйЭлемент = Элементы.Добавить("По", Тип("ПолеФормы"), ГруппаПериод);		
		НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_По";
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемент.Заголовок = "По";
	КонецЕсли;
	
	Элементы.ВидДоговора.УстановитьДействие("ПриИзменении", "ВидДоговораПриИзменении");
	
	ВывестиЭлементыНаФорму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ВывестиЭлементыНаФорму(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста 
Процедура ВывестиЭлементыНаФорму(Форма)

 Если Форма.Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
	
	   Форма.Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
	   Форма.Элементы.АбонентскаяПлата.Видимость = Истина;
	   Форма.Элементы.ПериодС.Видимость = Истина;
	   Форма.Элементы.По.Видимость = Истина;
	   
 Иначе
 	
 	 Форма.Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;
	 Форма.Элементы.АбонентскаяПлата.Видимость = Ложь;
	 Форма.Элементы.ПериодС.Видимость = Ложь;
	 Форма.Элементы.По.Видимость = Ложь;
	 
 КонецЕсли;
	
КонецПроцедуры

#КонецОбласти  
//--i.skachkova 30.04.2024
